# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a dataframe with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [2]:
#Your code here
cur.execute('''SELECT firstName, lastName, city, state
            FROM employees e
            LEFT JOIN offices o
            USING(officeCode)
            ORDER BY 1, 2;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
print(df)

Number of results: 23
   firstName   lastName           city       state
0       Andy     Fixter         Sydney
1    Anthony        Bow  San Francisco          CA
2      Barry      Jones         London
3      Diane     Murphy  San Francisco          CA
4   Foon Yue      Tseng            NYC          NY
5     George     Vanauf            NYC          NY
6     Gerard     Bondur          Paris
7     Gerard  Hernandez          Paris
8       Jeff   Firrelli  San Francisco          CA
9      Julie   Firrelli         Boston          MA
10     Larry       Bott         London
11    Leslie   Jennings  San Francisco          CA
12    Leslie   Thompson  San Francisco          CA
13      Loui     Bondur          Paris
14      Mami      Nishi          Tokyo  Chiyoda-Ku
15    Martin     Gerard          Paris
16      Mary  Patterson  San Francisco          CA
17    Pamela   Castillo          Paris
18     Peter      Marsh         Sydney
19     Steve  Patterson         Boston          MA
20       Tom       King         Sydney
21   William  Patterson         Sydney
22   Yoshimi       Kato          Tokyo  Chiyoda-Ku

## Customers and their Orders (a One-to-Many join)

Return a dataframe with all of the customers' first and last names along with details for each of their order numbers, order dates, and statuses.

In [5]:
# Your code here
cur.execute('''SELECT customerName, orderNumber, orderDate, status
            FROM customers c
            LEFT JOIN orders o
            USING (customerNumber)
            ORDER BY 1;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
print(df)

Number of results: 350
                     customerName orderNumber   orderDate     status
0                   ANG Resellers        None        None       None
1                  AV Stores, Co.       10110  2003-03-18    Shipped
2                  AV Stores, Co.       10306  2004-10-14    Shipped
3                  AV Stores, Co.       10332  2004-11-17    Shipped
4                    Alpha Cognac       10136  2003-07-04    Shipped
5                    Alpha Cognac       10178  2003-11-08    Shipped
6                    Alpha Cognac       10397  2005-03-28    Shipped
7          American Souvenirs Inc        None        None       None
8              Amica Models & Co.       10280  2004-08-17    Shipped
9              Amica Models & Co.       10293  2004-09-09    Shipped
10        Anna's Decorations, Ltd       10148  2003-09-11    Shipped
11        Anna's Decorations, Ltd       10169  2003-11-04    Shipped
12        Anna's Decorations, Ltd       10370  2005-01-20    Shipped
13        Anna's Decorations, Ltd       10391  2005-03-09    Shipped
14            Anton Designs, Ltd.        None        None       None
15     Asian Shopping Network, Co        None        None       None
16          Asian Treasures, Inc.        None        None       None
17              Atelier graphique       10123  2003-05-20    Shipped
18              Atelier graphique       10298  2004-09-27    Shipped
19              Atelier graphique       10345  2004-11-25    Shipped
20   Australian Collectables, Ltd       10193  2003-11-21    Shipped
21   Australian Collectables, Ltd       10265  2004-07-02    Shipped
22   Australian Collectables, Ltd       10415  2005-05-09   Disputed
23     Australian Collectors, Co.       10120  2003-04-29    Shipped
24     Australian Collectors, Co.       10125  2003-05-21    Shipped
25     Australian Collectors, Co.       10223  2004-02-20    Shipped
26     Australian Collectors, Co.       10342  2004-11-24    Shipped
27     Australian Collectors, Co.       10347  2004-11-29    Shipped
28    Australian Gift Network, Co       10152  2003-09-25    Shipped
29    Australian Gift Network, Co       10174  2003-11-06    Shipped
..                            ...         ...         ...        ...
320     The Sharp Gifts Warehouse       10407  2005-04-22    On Hold
321       Tokyo Collectables, Ltd       10258  2004-06-15    Shipped
322       Tokyo Collectables, Ltd       10339  2004-11-23    Shipped
323       Tokyo Collectables, Ltd       10372  2005-01-26    Shipped
324       Tokyo Collectables, Ltd       10408  2005-04-22    Shipped
325       Toms Spezialitäten, Ltd       10191  2003-11-20    Shipped
326       Toms Spezialitäten, Ltd       10310  2004-10-16    Shipped
327          Toys of Finland, Co.       10155  2003-10-06    Shipped
328          Toys of Finland, Co.       10299  2004-09-30    Shipped
329          Toys of Finland, Co.       10377  2005-02-09    Shipped
330             Toys4GrownUps.com       10145  2003-08-25    Shipped
331             Toys4GrownUps.com       10189  2003-11-18    Shipped
332             Toys4GrownUps.com       10367  2005-01-12   Resolved
333         UK Collectables, Ltd.       10253  2004-06-01  Cancelled
334         UK Collectables, Ltd.       10302  2003-10-06    Shipped
335         UK Collectables, Ltd.       10403  2005-04-08    Shipped
336               Vida Sport, Ltd       10225  2004-02-22    Shipped
337               Vida Sport, Ltd       10287  2004-08-30    Shipped
338               Vitachrome Inc.       10102  2003-01-10    Shipped
339               Vitachrome Inc.       10237  2004-04-05    Shipped
340               Vitachrome Inc.       10324  2004-11-05    Shipped
341      Volvo Model Replicas, Co       10112  2003-03-24    Shipped
342      Volvo Model Replicas, Co       10320  2004-11-03    Shipped
343      Volvo Model Replicas, Co       10326  2004-11-09    Shipped
344      Volvo Model Replicas, Co       10334  2004-11-19    On Hold
345              Warburg Exchange        None        None       None
346   West Coast Collectables Co.       10199  2003-12-01    Shipped
347   West Coast Collectables Co.       10215  2004-01-29    Shipped
348             giftsbymail.co.uk       10232  2004-03-20    Shipped
349             giftsbymail.co.uk       10316  2004-11-01    Shipped

[350 rows x 4 columns]

## Customers and their Payments (another One-to-Many join)

Return a dataframe with all of the customers' first and last names along with details about their payments' amount and date of payment. Sort these results in descending order by the payment amount.

In [13]:
# Your code here
cur.execute('''SELECT contactFirstName, contactLastName, paymentDate, amount
            FROM customers c
            LEFT JOIN payments p
            USING (customerNumber)
            ORDER BY 3 DESC;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
print(df)

Number of results: 297
    contactFirstName  contactLastName paymentDate     amount
0              Paul           Henriot  2005-06-09   46656.94
1           Annette            Roulet  2005-06-03   12432.32
2               Tony          Snowden  2005-05-25   30253.75
3               Mike           Graham  2005-05-23   75020.13
4              Jean         Fresnière  2005-05-20   29070.38
5             Diego            Freyre  2005-05-19   46895.48
6              Julie             King  2005-05-19   28500.78
7              Akiko        Shimamura  2005-05-18     615.45
8             Daniel         Da Silva  2005-05-17   17928.09
9        Frédérique           Citeaux  2005-05-03   35157.75
10           Roland            Mendel  2005-05-03    8807.12
11              Anna           O'Hara  2005-04-30   29848.52
12         Dominique          Perrier  2005-04-23   12190.85
13            Martha          Larsson  2005-04-18   27966.54
14             Susan           Nelson  2005-04-16   83598.04
15           Violeta          Benitez  2005-04-15   30293.77
16              Eric        Natividad  2005-03-27    3516.04
17            Diego            Freyre  2005-03-25   65071.26
18            Diego            Freyre  2005-03-18  120166.58
19             Julie            Brown  2005-03-15   46781.66
20             Matti        Karttunen  2005-03-10   23602.90
21             Susan           Nelson  2005-03-05  101244.59
22              Mary            Young  2005-03-02    3452.75
23               Ben         Calaghan  2005-03-01   21432.31
24           Janine           Labrune  2005-02-22   49523.67
25            Pirkko        Koskitalo  2005-02-15   46770.52
26             Akiko        Shimamura  2005-02-14   33967.73
27             Allen           Nelson  2005-02-12   28322.83
28              Anna           O'Hara  2005-02-09   27083.78
29             Julie            Young  2005-02-06   39580.60
..               ...              ...         ...        ...
267           Diego            Freyre  2003-02-25   40206.20
268           Jytte          Petersen  2003-02-20   53959.21
269           Jonas        Bergulfsen  2003-02-16   50218.95
270          Michael            Frick  2003-01-30    5494.78
271           Roland           Keitel  2003-01-28   10549.01
272          Dorothy            Young  2003-01-16   10223.83
273         Zbyszek   Piestrzeniewicz        None       None
274            Keith           Franco        None       None
275          Isabel         de Castro        None       None
276           Brydey           Walker        None       None
277           Horst             Kloss        None       None
278       Alejandra            Camino        None       None
279          Renate           Messner        None       None
280           Peter           Franken        None       None
281               Ed         Harrison        None       None
282          Bradley         Schuyler        None       None
283              Mel         Andersen        None       None
284          Philip            Cramer        None       None
285        Patricia           McKenna        None       None
286           Armand            Kuger        None       None
287            Karin          Josephs        None       None
288            Lino         Rodriguez        None       None
289            Braun              Urs        None       None
290            Rita            Müller        None       None
291       Alexander             Feuer        None       None
292            Sven           Ottlieb        None       None
293           Carmen            Anton        None       None
294           Hanna              Moos        None       None
295       Alexander           Semenov        None       None
296           Raanan      Altagar,G M        None       None

[297 rows x 4 columns]

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a dataframe with all of the customers' first and last names along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

- Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [14]:
# Your code here
cur.execute('''SELECT contactFirstName, contactLastName, productName, quantityOrdered, orderDate
            FROM customers c
            JOIN orders o
            USING (customerNumber)
            JOIN orderdetails od
            USING (orderNumber)
            JOIN products p 
            USING (productCode)
            ORDER BY 4 DESC;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
print(df)

Number of results: 2996
     contactFirstName contactLastName  \
0         Frédérique          Citeaux
1                Mike          Graham
2             William           Brown
3                Mike          Graham
4             William           Brown
5         Frédérique          Citeaux
6                 Sue           Frick
7                 Sue           Frick
8              Diego           Freyre
9              Georg            Pipps
10             Diego           Freyre
11          Elizabeth           Devon
12          Elizabeth           Devon
13             Adrian          Huxley
14                Sue           Frick
15             Jytte         Petersen
16              Wales       MacKinlay
17               Mike          Graham
18            William           Brown
19                Sue           Frick
20                Sue           Frick
21            William           Brown
22             Jytte         Petersen
23              Wendy       Victorino
24        Frédérique          Citeaux
25             Diego           Freyre
26             Adrian          Huxley
27               Juri         Yoshido
28              Wendy       Victorino
29                Sue           Frick
...               ...             ...
2966           Georg            Pipps
2967        Maurizio           Moroni
2968        Maurizio           Moroni
2969            Akiko       Shimamura
2970        Dominique         Perrier
2971           Martha         Larsson
2972              Sue           Frick
2973          Roland           Mendel
2974          Martín           Sommer
2975             Sean        Clenahan
2976             Sean        Clenahan
2977             Rosa         Salazar
2978              Sue          Taylor
2979          Janine          Labrune
2980           Diego           Freyre
2981          Janine          Labrune
2982        Maurizio           Moroni
2983             Sean        Clenahan
2984            Sarah           McRoy
2985           Adrian          Huxley
2986           Georg            Pipps
2987        Maurizio           Moroni
2988            Akiko       Shimamura
2989              Sue           Frick
2990           Georg            Pipps
2991          Janine          Labrune
2992          William           Brown
2993       Catherine            Dewey
2994           Georg            Pipps
2995            Sarah           McRoy

                                      productName quantityOrdered   orderDate
0                              1969 Dodge Charger              97  2005-04-14
1                            1969 Dodge Super Bee              90  2005-04-08
2                  America West Airlines B757-200              85  2005-04-03
3                         1970 Plymouth Hemi Cuda              77  2005-04-08
4                              F/A 18 Hornet 1/72              77  2005-04-03
5                         1956 Porsche 356A Coupe              76  2005-04-14
6                        1917 Grand Touring Sedan              76  2005-04-22
7                              1949 Jaguar XK 120              76  2005-04-22
8                        1962 Volkswagen Microbus              70  2005-05-03
9                         1956 Porsche 356A Coupe              70  2005-05-17
10          1969 Harley Davidson Ultimate Chopper              66  2005-05-13
11           2003 Harley-Davidson Eagle Drag Bike              66  2005-04-08
12                               2002 Suzuki XREO              66  2005-04-08
13            1932 Alfa Romeo 8C2300 Spider Sport              66  2005-05-29
14                          1957 Ford Thunderbird              66  2005-04-22
15                 1948 Porsche Type 356 Roadster              65  2005-04-15
16                           1937 Lincoln Berline              65  2005-04-29
17                              1968 Ford Mustang              64  2005-04-08
18                       Corsair F4U ( Bird Cage)              64  2005-04-03
19                            1972 Alfa Romeo GTA              64  2005-04-01
20                      1966 Shelby Cobra 427 S/C              64  2005-04-22
21                       1928 Ford Phaeton Deluxe              62  2005-04-03
22                                1993 Mazda RX-7              61  2005-04-15
23                    1939 Chevrolet Deluxe Coupe              61  2005-04-23
24                    1948 Porsche 356-A Roadster              61  2005-04-14
25                    1992 Ferrari 360 Spider red              60  2005-05-03
26                     1970 Chevy Chevelle SS 454              60  2005-05-29
27               1912 Ford Model T Delivery Wagon              60  2005-05-06
28                      1932 Model A Ford J-Coupe               6  2005-04-23
29            1932 Alfa Romeo 8C2300 Spider Sport               6  2005-04-22
...                                           ...             ...         ...
2966                    1937 Horch 930V Limousine              20  2003-04-28
2967               1998 Chrysler Plymouth Prowler              20  2003-11-06
2968                 1999 Indy 500 Monte Carlo SS              20  2004-07-06
2969  1996 Peterbilt 379 Stake Bed with Outrigger              20  2004-06-15
2970                         1969 Dodge Super Bee              20  2004-05-26
2971             1912 Ford Model T Delivery Wagon              20  2003-10-23
2972                             Boeing X-32A JSF              20  2005-04-01
2973                  1948 Porsche 356-A Roadster              20  2003-11-04
2974                  1939 Chevrolet Deluxe Coupe              20  2004-01-26
2975    1938 Cadillac V-16 Presidential Limousine              20  2003-11-21
2976                        1936 Chrysler Airflow              20  2003-11-21
2977                           2002 Yamaha YZR M1              20  2004-11-17
2978                        1936 Chrysler Airflow              20  2003-09-12
2979                        1926 Ford Fire Engine              19  2005-05-31
2980                  1954 Greyhound Scenicruiser              19  2005-05-03
2981             Diamond T620 Semi-Skirted Tanker              18  2005-05-31
2982                     Corsair F4U ( Bird Cage)              18  2005-05-10
2983                    1937 Horch 930V Limousine              18  2005-05-09
2984                         1969 Dodge Super Bee              16  2005-05-16
2985             1936 Mercedes Benz 500k Roadster              15  2005-05-29
2986                      1982 Lamborghini Diablo              15  2005-05-17
2987                               P-51-D Mustang              15  2005-05-10
2988             1936 Mercedes Benz 500k Roadster              15  2005-04-22
2989                    1969 Chevrolet Camaro Z28              13  2005-04-22
2990                            1968 Ford Mustang              12  2005-05-17
2991                  1954 Greyhound Scenicruiser              11  2005-05-31
2992                  American Airlines: B767-300              11  2005-04-03
2993                  1913 Ford Model T Speedster              10  2005-05-30
2994                           1968 Dodge Charger              10  2005-05-17
2995                        1961 Chevrolet Impala              10  2005-05-16

[2996 rows x 5 columns]

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!